Tekla Open API Reference for Tekla Structures 2025
Point.Zero Method
 Zeros all the members of the point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Zero()
Public Sub Zero
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace